Tekla.Structures.Filtering.FilterExpressionFileType
The filter expression file type defines the filter expression file types.

Tekla.Structures.Filtering.FilterExpressionFileType.OBJECT_GROUP_SELECTION
The object group selection filter.

Tekla.Structures.Filtering.FilterExpressionFileType.OBJECT_GROUP_VIEW
The object group view filter.

Tekla.Structures.Filtering.FilterExpressionFileType.DRAWING_SINGLE_PART
The drawing single part filter.

Tekla.Structures.Filtering.FilterExpressionFileType.DRAWING_ASSEMBLY
The drawing assembly filter.

Tekla.Structures.Filtering.FilterExpressionFileType.DRAWING_CAST_UNIT
The drawing cast unit filter.

Tekla.Structures.Filtering.FilterExpressionFileType.DRAWING_GENERAL
The drawing general filter.